#include <stdio.h>			// 
#include <stdlib.h>			// подключение стандартных библиотек
#include <string.h>			//

int main() {
    int i=0;			//
    int j=0;			// счетчики
    int k=0;			//
    int m=0;			// триггер
    char plus[2]="+";			//
    char minus[2]="-";			// массивы с символами операций
    char umn[2]="*";			// (дл€ использовани€ в strcmp)
    char del[2]="/";			//
    char origin[100];		// массив дл€ исходной последовательности
    char nums[100][100];		// массив дл€ токенов из origin
    int inums[100];		// массив дл€ токенов, преобразованных в int
    int stack[100];		// стековый массив
    fgets(origin, 100, stdin);	// счет с потока ввода
    char* token=strtok(origin, " ");	//
    while(token!=NULL)				//
    {							//
        int numb=strlen(token);		// деление массива origin 
        strncpy(nums[i], token, numb);	// на токены
        token=strtok(NULL, " ");		//
        i++;					//
    }							//
    for(j=0;j<=i;j++){				// цикл перевода цифр из 
        inums[j]=atoi(nums[j]);		// типа char в int
    }					// (символы операций перевод€тс€ как 0)
    for(j=0;j<=i;j++){			//
        if(inums[k]!=0){		// вы€вление символов операций
            stack[j]=inums[k];	// (если число, то записываетс€ в стек,
            k++;				// иначе Ц символ операции)
        }					//
        else{
            if(strcmp(nums[k], plus)==0){	// (*) обращаемс€ к токену ===
                if(j>=2){					// проверка элементов
                stack[j-2]=stack[j-2]+stack[j-1];	// операци€ с ними
                stack[j-1]=0;					// обнуление ненужного
                j-=2;						// откат счетчика
                k++;						// 
                }							//
                else{					// иначе
                    m=1;				// переключение триггера
                    j=i;				// завершение цикла
                }						// 
            }						// (*) ======================
            else if(strcmp(nums[k], minus)==0){	// ===================
                if(j>=2){					// идентично (*)
                stack[j-2]=stack[j-2]-stack[j-1];	//
                stack[j-1]=0;					//
                j-=2;						//
                k++;						//
                }							//
                else{						//
                    m=1;					//
                    j=i;					//
                }							//
            }							// =======================
            else if(strcmp(nums[k], umn)==0){		// =======================
                if(j>=2){					// идентично (*)
                stack[j-2]=stack[j-2]*stack[j-1];	//
                stack[j-1]=0;					//
                j-=2;						//
                k++;						//
                }							//
                else{						//
                    m=1;					//
                    j=i;					//
            }							// =====================
            else if(strcmp(nums[k], del)==0){		// =====================
                if(j>=2){					// идентично (*)
                stack[j-2]=stack[j-2]/stack[j-1];	//
                stack[j-1]=0;					//
                j-=2;						//
                k++;						//
                }							//
                else{						//
                    m=1;					//
                    j=i;					//
                }							//
            }							// =====================
                }
    }									//
            for(j=1;j<i;j++){					// проверка наличи€
            if(stack[j]!=0){					// лишних элементов
                m=1;						// в стеке
            }							//
        }								//
    if(m==0){						//
        printf("\n%d", stack[0]);			// вывод результата
    }								//
    else{							//
        printf("error");				//
    }								//
  return 0;						// завершение работы программы
}							
